// Напишите программу, которая принимает на вход трехзначное число и на выходе показывает последюю цифру этого числа
// Например, 456 -> 6  

Console.WriteLine("Введите трехзначное число: ");
int number = Convert.ToInt32(Console.ReadLine());
Console.WriteLine($" Последяя цифра этого числа {number % 10}");
